In [1]:
# 2.3.0  merge dataframe
# 2.3.1 df_merge = pd.merge(temperature_df,humidity_df, on = "city")
# 2.3.2 indicator =True
# 2.3.3 suffixes=('left','right')
# 2.3.4 np.where(new_df['temperature']> 27,'low', 0 )
# 2.3.5 create new columns in series type
# 2.3.6 dfw.loc[1, :]

In [2]:
import pandas as pd
import numpy as np

# 2.3 merge dataframe

In [3]:
temperature_df = pd.DataFrame ({
    "city" : ["Nashik", "Mumbai", "Pune"],
    "temperature" : [21,32,25]
})

temperature_df

     city  temperature
0  Nashik           21
1  Mumbai           32
2    Pune           25

In [4]:
humidity_df = pd.DataFrame ({
    "city" : ["Pune","Nashik", "Mumbai"],
    "humidity": [55,48,32]
})
humidity_df

     city  humidity
0    Pune        55
1  Nashik        48
2  Mumbai        32

In [5]:
df_merge = pd.merge(temperature_df,humidity_df, on = "city")
df_merge

     city  temperature  humidity
0  Nashik           21        48
1  Mumbai           32        32
2    Pune           25        55

In [6]:
df_merge = pd.merge(temperature_df,humidity_df, on = "city", indicator =True)
df_merge

     city  temperature  humidity _merge
0  Nashik           21        48   both
1  Mumbai           32        32   both
2    Pune           25        55   both

In [7]:
usa = pd.DataFrame ({
    "city" : ["Chicago", "Nashik", "Pune", "Mumbai"],
    "temperature" : [29, 21,32,25],
    "humidity": [65,58,62,56]
})

usa

      city  temperature  humidity
0  Chicago           29        65
1   Nashik           21        58
2     Pune           32        62
3   Mumbai           25        56

In [8]:
india = pd.DataFrame ({
    "city" : ["Nashik", "Mumbai", "Pune", "Chicago"],
    "temperature" : [32,28,30,21],
    "humidity": [55,48,32,45]
})
india

      city  temperature  humidity
0   Nashik           32        55
1   Mumbai           28        48
2     Pune           30        32
3  Chicago           21        45

In [9]:
df9 =pd.merge(usa,india, on="city")
df9

      city  temperature_x  humidity_x  temperature_y  humidity_y
0  Chicago             29          65             21          45
1   Nashik             21          58             32          55
2     Pune             32          62             30          32
3   Mumbai             25          56             28          48

In [10]:
df9 =pd.merge(usa,india, on="city", suffixes=('left','right'))
df9

      city  temperatureleft  humidityleft  temperatureright  humidityright
0  Chicago               29            65                21             45
1   Nashik               21            58                32             55
2     Pune               32            62                30             32
3   Mumbai               25            56                28             48

In [11]:
df9['tempwind']= np.where(df9['temperatureleft']> 27,'low', 0 )
df9['tempwind']

0    low
1      0
2    low
3      0
Name: tempwind, dtype: object

In [12]:
df9['tempwind']= np.square(df9['temperatureleft'] + df9['humidityleft'])
df9['tempwind']

0    8836
1    6241
2    8836
3    6561
Name: tempwind, dtype: int64

# below are under construction & exercises

In [13]:
matrixx = [
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12]
]

dfc = pd.DataFrame(matrixx)

In [14]:
dfc

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [15]:
dfg= pd.DataFrame([[12,2,3,47],[5,36,7,48],[9,10,41,12]], columns = ["d","t","w","e"],)

In [16]:
dfg

    d   t   w   e
0  12   2   3  47
1   5  36   7  48
2   9  10  41  12

In [17]:
dfw = pd.DataFrame([[1,2,3,4],
                    [5,6,7,8],
                    [9,10,11,12],
                    [56,63,75,8],
                   [87,54,9,24]], columns = ["day","temperature","windspeed","event"])

In [18]:
dfw

   day  temperature  windspeed  event
0    1            2          3      4
1    5            6          7      8
2    9           10         11     12
3   56           63         75      8
4   87           54          9     24

In [19]:
dfw.min()

day            1
temperature    2
windspeed      3
event          4
dtype: int64

In [20]:
dfw.mean()

day            31.6
temperature    27.0
windspeed      21.0
event          11.2
dtype: float64

In [21]:
dfw.loc[0, :]

day            1
temperature    2
windspeed      3
event          4
Name: 0, dtype: int64

In [22]:
dfw.loc[2, :]

day             9
temperature    10
windspeed      11
event          12
Name: 2, dtype: int64

In [23]:
dfw.loc[2]

day             9
temperature    10
windspeed      11
event          12
Name: 2, dtype: int64

In [24]:
#select row

In [25]:
dfw.loc[2:4, :]

   day  temperature  windspeed  event
2    9           10         11     12
3   56           63         75      8
4   87           54          9     24

In [26]:
dfw.loc[2:4]

   day  temperature  windspeed  event
2    9           10         11     12
3   56           63         75      8
4   87           54          9     24

In [27]:
#select columns

In [28]:
dfw.loc[: ,'temperature': 'event']

   temperature  windspeed  event
0            2          3      4
1            6          7      8
2           10         11     12
3           63         75      8
4           54          9     24

In [29]:
dfw.loc[0:2 , 'temperature': 'event']

   temperature  windspeed  event
0            2          3      4
1            6          7      8
2           10         11     12

In [30]:
dfw.loc[0:2 , ['temperature', 'event', 'windspeed']]

   temperature  event  windspeed
0            2      4          3
1            6      8          7
2           10     12         11

In [31]:
df9

,city,temperatureleft,humidityleft,temperatureright,humidityright,tempwind
0,Chicago,29,65,21,45,8836
1,Nashik,21,58,32,55,6241
2,Pune,32,62,30,32,8836
3,Mumbai,25,56,28,48,6561

In [32]:
df9.loc[df9.city== 'Nashik', 'temperatureright']

1    32
Name: temperatureright, dtype: int64

In [33]:
dfw

   day  temperature  windspeed  event
0    1            2          3      4
1    5            6          7      8
2    9           10         11     12
3   56           63         75      8
4   87           54          9     24

In [34]:
dfw.iloc[:,1:3]

   temperature  windspeed
0            2          3
1            6          7
2           10         11
3           63         75
4           54          9

In [35]:
dfw.iloc[1:3, :]

   day  temperature  windspeed  event
1    5            6          7      8
2    9           10         11     12

In [36]:
dfw.iloc[0:2,1:3]

   temperature  windspeed
0            2          3
1            6          7

In [39]:
matrixx = [
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12]
]

dfc = pd.DataFrame(matrixx)

dfc

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [40]:
dfg= pd.DataFrame([[12,2,3,47],[5,36,7,48],[9,10,41,12]], columns = ["d","t","w","e"],)

dfg

    d   t   w   e
0  12   2   3  47
1   5  36   7  48
2   9  10  41  12

In [41]:
dfw = pd.DataFrame([[1,2,3,4],
                    [5,6,7,8],
                    [9,10,11,12],
                    [56,63,75,8],
                   [87,54,9,24]], columns = ["day","temperature","windspeed","event"])

dfw

   day  temperature  windspeed  event
0    1            2          3      4
1    5            6          7      8
2    9           10         11     12
3   56           63         75      8
4   87           54          9     24

In [42]:
dfw.iloc[0:2,1:3]

   temperature  windspeed
0            2          3
1            6          7

In [44]:
tableformat = pd.read_table('http://bit.ly/movieusers')
tableformat.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [49]:
tableformat2 = pd.read_csv("http://bit.ly/movieusers")
tableformat2.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [45]:
tableformat = pd.read_table('http://bit.ly/movieusers', sep='|')
tableformat.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

In [46]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
tableformat = pd.read_table('http://bit.ly/movieusers', sep='|', header=None)
tableformat.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [47]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
tableformat = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)
tableformat.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213